sdaiPutAttrsBN(Sdai_instS*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*,SdaiPrimitiveType,BTEllipsis)
\details
Sets new values to specified application instance attributes.
\param appInstance   [in] An application instance that contains the attributes.
\param numberAttr    [in] A number of attributes to set their values.
\param attributeName [in] A string that contains the attribute name.
\param valueType     [in] An attribute value type.
\code
SdaiModel model = ...;
SdaiAppInstance startPoint = sdaiCreateInstanceBN(model, "IfcCartesianPoint");
SdaiAppInstance lineSegment2D = sdaiCreateInstanceBN(model, "IfcLineSegment2D");
sdaiPutAttrsBN(lineSegment2D, 3,
"StartPoint", sdaiINSTANCE, startPoint,
"StartDirection", sdaiREAL, startDirection,
"SegmentLength", sdaiREAL, segmentLength);
\remarks
The function is case insensitive.